; Очистка памяти
RAM_Flush:	LDI		ZL,Low(SRAM_START)
			LDI		ZH,High(SRAM_START)
			CLR		R16
Flush:		ST 		Z+,R16
			CPI		ZH,High(RAMEND)
			BRNE	Flush

			CPI		ZL,Low(RAMEND)
			BRNE	Flush

			CLR		ZL
			CLR		ZH


;==================================================================================
; Init RTOS
;==================================================================================
			INIT_RTOS
;==================================================================================
; Инициализация периферии
;----------------------------------------------------------------------------------			
			OUTI	TIMSK,0<<TOIE0|1<<OCF2		; Разрешаем прерывание по переполнению Т0
;UART Init ========================================================================
			USART_INIT
;Init ADC==========================================================================
			OUTI	ADMUX,0b01100101

			OUTI	DDRB,0xFF
			OUTI	PORTB,0
